beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_ble_manager.c
        case CUS_STAT_EVT_CONNECTED :
            break;

        case CUS_STAT_EVT_DISCONNECTED:
            isCusStatNotificationEnabled = false;
            NRF_LOG_INFO("BLE_MANAGER: isCusStatNotificationEnabled: false");
            break;

        case CUS_STAT_EVT_WRITE:

            //Allocate memory for "gatts_value" variable:
            memset(&gatts_value, 0, sizeof(gatts_value));
            gatts_value.offset  = 0;
            gatts_value.len     = sizeof(device_status_data);
            gatts_value.p_value = (uint8_t*) &data_buffer;

            //If the STAT characteristic notification is enabled, then the STAT characteristic changed by the NordicSoftdevice is valid:
            if(bleGetCusStatNotificationFlag())
            {               
                //Get the last STAT characteristic written by the phone app and store on "data_buffer":
                err_code = sd_ble_gatts_value_get(p_cus_service->conn_handle, p_cus_service->custom_value_handles.value_handle, &gatts_value);
                APP_ERROR_CHECK(err_code);

                //Store the commandFromPhoneAux = command of the STAT characteristic written by the phone:
                bool commandFromPhoneAux = (bool) data_buffer[0];
                
                //The command of the STAT characteristic is analysed only if is different from the command in device status data:
                if(commandFromPhoneAux != deviceStatus_getStructData_commandFromPhone())
                {                    
                    //If the command from phone app is true:
                    if(commandFromPhoneAux){
                        //And if the detection system is not measuring, then start detection system task: 
                        if(!deviceStatus_getStructData_isDataOnFlash())
                        {
                            NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic is gonna be stored in the device status data.");
                     
                            //Update the status data (now the nrf52 is commanded to start the detection task):
                            deviceStatus_saveStructData_commandFromPhone(true);
                            NRF_LOG_INFO("BLE_MANAGER: commandFromPhone = %d.", deviceStatus_getStructData_commandFromPhone());

                            //Start the detection system timers:
                            NRF_LOG_INFO("BLE_MANAGER: Detection System Task Starts.");
                            timerDetectionSystem_Start();
                            secondsStart();
                            hundredMillisStart();
                            
                            //Update the device status data (now it's measuring and there is data on flash):
                            deviceStatus_saveStructData_isMeasuring(true);
                            NRF_LOG_INFO("BLE_MANAGER: isMeasuring = %d.", deviceStatus_getStructData_isMeasuring());
                            deviceStatus_saveStructData_isDataOnFlash(true);
                            deviceStatus_saveStructData_fileName(data_buffer[3], data_buffer[4], data_buffer[5], data_buffer[6], data_buffer[7], data_buffer[8]);
                            deviceStatus_saveStructData_timeDuration(data_buffer[9], data_buffer[10], data_buffer[11]);
                            deviceStatus_saveStructData_tempReference(data_buffer[12]);
                            NRF_LOG_INFO("BLE_MANAGER: isDataOnFlash = %d.", deviceStatus_getStructData_isDataOnFlash());
                            NRF_LOG_INFO("BLE_MANAGER: fileName_year = %d.", deviceStatus_getStructData().fileName_year);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_month = %d.", deviceStatus_getStructData().fileName_month);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_day = %d.", deviceStatus_getStructData().fileName_day);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_hrs = %d.", deviceStatus_getStructData().fileName_hrs);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_mins = %d.", deviceStatus_getStructData().fileName_mins);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_secs = %d.", deviceStatus_getStructData().fileName_secs);
                            NRF_LOG_INFO("BLE_MANAGER: timeDuration_hrs = %d.", deviceStatus_getStructData().timeDuration_hrs);
                            NRF_LOG_INFO("BLE_MANAGER: timeDuration_mins = %d.", deviceStatus_getStructData().timeDuration_mins);
                            NRF_LOG_INFO("BLE_MANAGER: timeDuration_secs = %d.", deviceStatus_getStructData().timeDuration_secs);
                            NRF_LOG_INFO("BLE_MANAGER: tempReference = %d.", deviceStatus_getStructData().tempReference);
                            
                            //Change the "data_buffer" to update STAT characteristic:
                            data_buffer[0] = deviceStatus_getStructData_commandFromPhone();
                            data_buffer[1] = deviceStatus_getStructData_isMeasuring();
                            data_buffer[2] = deviceStatus_getStructData_isDataOnFlash();
                            data_buffer[3] = deviceStatus_getStructData().fileName_year;
                            data_buffer[4] = deviceStatus_getStructData().fileName_month;
                            data_buffer[5] = deviceStatus_getStructData().fileName_day;
                            data_buffer[6] = deviceStatus_getStructData().fileName_hrs;
                            data_buffer[7] = deviceStatus_getStructData().fileName_mins;
                            data_buffer[8] = deviceStatus_getStructData().fileName_secs;
                            data_buffer[9]  = deviceStatus_getStructData().timeDuration_hrs;
                            data_buffer[10] = deviceStatus_getStructData().timeDuration_mins;
                            data_buffer[11] = deviceStatus_getStructData().timeDuration_secs;
                            data_buffer[12] = deviceStatus_getStructData().tempReference;

