beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_ble_manager.c
                            //Send a notification back to the phone app of the STAT characteristic written (stored on "data_buffer"):
                            uint32_t err_code = cus_stat_custom_value_update(p_cus_service, data_buffer);
                            APP_ERROR_CHECK(err_code);
                            NRF_LOG_INFO("BLE_MANAGER: Send notification of the STAT characteristic. commandFromPhone = %d. isMeasuring = %d. isDataOnFlash = %d", deviceStatus_getStructData_commandFromPhone(), deviceStatus_getStructData_isMeasuring(), deviceStatus_getStructData_isDataOnFlash());
                        }
                        //But if the detection system is measuring, then print log info:
                        else
                        {
                            NRF_LOG_INFO("BLE_MANAGER: The Detection System is already measuring, so you have to wait until detection system task stops.");
                            NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic will not be stored in the device status data.");
                        }
                    }
                    //If the command from phone app is false:
                    else
                    {
                        //And if the detection system is measuring, then the main will stop the detection system task soon:
                        if(deviceStatus_getStructData_isDataOnFlash())
                        {
                            NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic is gonna be stored in the device status data.");
                     
                            //Update the status data (now the nrf52 is commanded to stop the detection task):
                            deviceStatus_saveStructData_commandFromPhone(false);
                            NRF_LOG_INFO("BLE_MANAGER: commandFromPhone = %d.", deviceStatus_getStructData_commandFromPhone());

                            //Change the "data_buffer" to update STAT characteristic:
                            data_buffer[0] = deviceStatus_getStructData_commandFromPhone();
                            data_buffer[1] = deviceStatus_getStructData_isMeasuring();

                            //Send a notification back to the phone app of the STAT characteristic written (stored on "data_buffer"):
                            uint32_t err_code = cus_stat_custom_value_update(p_cus_service, data_buffer);
                            APP_ERROR_CHECK(err_code);
                            NRF_LOG_INFO("BLE_MANAGER: Send notification of the STAT characteristic. commandFromPhone = %d. isMeasuring = %d. isDataOnFlash = %d", deviceStatus_getStructData_commandFromPhone(), deviceStatus_getStructData_isMeasuring(), deviceStatus_getStructData_isDataOnFlash());
                            NRF_LOG_INFO("BLE_MANAGER: Wait until the detection system task stops.");
                        }
                        //But if the detection system is not measuring, then print log info:
                        else
                        {
                            NRF_LOG_INFO("BLE_MANAGER: The Detection System is not measuring, so the command from phone was not necessary");
                            NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic will not be stored in the device status data.");
                        }
                    }
                }
                //If the command of the STAT characteristic sent by the phone is the same as the device status command, then print log info:
                else
                {
                    NRF_LOG_INFO("BLE_MANAGER: The ble command sent by the phone is the same as the stored. commandFromPhone = %d", deviceStatus_getStructData_commandFromPhone());
                }

            }
            //If the STAT characteristic notification is disabled, then the STAT characteristic changed by the NordicSoftdevice is not valid:
            else
            {
                NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic is not valid when notification is disabled.");

                //Update and notify the STAT characteristic (must be the status data stored):
                device_status_data dataCusStat = deviceStatus_getStructData();
                data_buffer[0] = dataCusStat.commandFromPhone;
                data_buffer[1] = dataCusStat.isMeasuring;
                data_buffer[2] = dataCusStat.isDataOnFlash;
                data_buffer[3] = dataCusStat.fileName_year;
                data_buffer[4] = dataCusStat.fileName_month;
                data_buffer[5] = dataCusStat.fileName_day;
                data_buffer[6] = dataCusStat.fileName_hrs;
                data_buffer[7] = dataCusStat.fileName_mins;
                data_buffer[8] = dataCusStat.fileName_secs;
                err_code = sd_ble_gatts_value_set(p_cus_service->conn_handle, p_cus_service->custom_value_handles.value_handle, &gatts_value);
                APP_ERROR_CHECK(err_code);
                NRF_LOG_INFO("BLE_MANAGER: The STAT characteristic is the same as the device status data.");
            }

            break;

        default:
              // No implementation needed.
              break;
    }
}


/**@brief Function for handling the Custom Service Service events.
 *
 * @details This function will be called for all Custom Service events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service  Custom Service structure.
 * @param[in]   p_evt          Event received from the Custom Service.
 *
 */
static void on_cus_sens_evt(cus_sens_t * p_cus_service, cus_sens_evt_t * p_evt)
{
    uint32_t err_code;
    switch(p_evt->evt_type)
    {
        case CUS_SENS_EVT_NOTIFICATION_ENABLED:
            isCusSensNotificationEnabled = true;
            NRF_LOG_INFO("BLE_MANAGER: isCusSensNotificationEnabled: true");
            break;

        case CUS_SENS_EVT_NOTIFICATION_DISABLED:
            isCusSensNotificationEnabled = false;
            NRF_LOG_INFO("BLE_MANAGER: isCusSensNotificationEnabled: false");
            break;

        case CUS_SENS_EVT_CONNECTED :
            break;

